{
  "site_url": "https://veraserg.io",
  "site_title": "veraserg.io",
  "name": "Sergio Vera",
  "about": "Computer Science Engineer with over a decade of experience as a Software Developer from Santiago, Chile.",
  "socials": {
    "github": "https://github.com/elsergiovera",
    "linkedin": "https://www.linkedin.com/in/elsergiovera/",
    "email": "verasergio@gmail.com"
  },
  "experience": [
    {
      "name": "KNOCK IT",
      "location": "Santiago, Chile",
      "start": "August 2025",
      "end": "Present",
      "description": [
        "Front-End Development",
        "Back-End Development",
        "AWS"
      ]
    },
    {
      "name": "Ingeniería Civil Vicente (ICV)",
      "location": "Santiago, Chile",
      "start": "July 2024",
      "end": "July 2025",
      "description": [
        "Front-End Development focused on migrating desktop software to web platforms using React with TypeScript, optimizing the build process with Vite.",
        "Implemented interactive and responsive UIs with Handsontable, Shadcn, Ant Design, Lucide Icons, and TailwindCSS.",
        "Zustand library for centralized state management, improving data synchronization and application performance.",
        "Integrated APIs with Axios, ensuring efficient and secure communication with the Back-End.",
        "Back-End Development of APIs in .NET Core with C#, using Entity Framework for a stable and scalable data flow.",
        "Worked with PostgreSQL for data storage and management."
      ]
    },
    {
      "name": "Vibia",
      "location": "Barcelona, Spain",
      "start": "June 2023",
      "end": "April 2024",
      "description": [
        "Front End dynamic web applications development featuring 3D user interfaces with React, using Three.js and React Three Fiber libraries.",
        "Back End RESTful APIs development with Node-RED low-code platform for fast deploy and intergration.",
        "Comprehensive Unit Testing using Jest along with Test-Driven Development methodology to ensure the reliability and robustness of the software.",
        "Global State management with Jotai to enhance application performance.",
        "Domain-Driven Design principles to design scalable and maintainable solutions.",
        "Trunk Based Development methodology with CI/CD practices for agile and seamless deployments.",
        "Pair Programming sessions following Scrum agile methodology, fostering collaborative problem-solving and knowledge sharing."
      ]
    },
    {
      "name": "Larrain Vial",
      "location": "Santiago, Chile",
      "start": "March 2019",
      "end": "March 2023",
      "description": [
        "Performing comprehensive project analysis, precise estimation, and efficient task delegation for company projects.",
        "Front End dynamic web applications development with Microsoft .NET, following MVC pattern, using ASP.NET Razor, C#, Ajax, JQuery and Bootstrap.",
        "Back End SOAP Web Services and RESTful API development with Microsoft .NET, using C#, Entity, Dapper, Swagger and LinQ.",
        "High Complexity Stored Procedures development in Microsoft SQL Server."
      ]
    }
  ]
}